cmsis-svd/cmsis-svd/data/Microchip/ATSAMC20N.svd
        <register>
          <name>STATUSC</name>
          <description>Peripheral write protection status - Bridge C</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x02000000</resetValue>
          <fields>
            <field>
              <name>EVSYS_</name>
              <description>EVSYS APB Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM0_</name>
              <description>SERCOM0 APB Protect Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM1_</name>
              <description>SERCOM1 APB Protect Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM2_</name>
              <description>SERCOM2 APB Protect Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM3_</name>
              <description>SERCOM3 APB Protect Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM4_</name>
              <description>SERCOM4 APB Protect Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM5_</name>
              <description>SERCOM5 APB Protect Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC0_</name>
              <description>TCC0 APB Protect Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC1_</name>
              <description>TCC1 APB Protect Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC2_</name>
              <description>TCC2 APB Protect Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC0_</name>
              <description>TC0 APB Protect Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1_</name>
              <description>TC1 APB Protect Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2_</name>
              <description>TC2 APB Protect Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC3_</name>
              <description>TC3 APB Protect Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC4_</name>
              <description>TC4 APB Protect Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC0_</name>
              <description>ADC0 APB Protect Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC_</name>
              <description>AC APB Protect Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTC_</name>
              <description>PTC APB Protect Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCL_</name>
              <description>CCL APB Protect Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSD</name>
          <description>Peripheral write protection status - Bridge D</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SERCOM6_</name>
              <description>SERCOM6 APB Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM7_</name>
              <description>SERCOM7 APB Protect Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC5_</name>
              <description>TC5 APB Protect Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC6_</name>
              <description>TC6 APB Protect Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC7_</name>
              <description>TC7 APB Protect Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
